import React from "react";
import styled from "styled-components";

const Policy = () => {
    return (
        <PolicyContainerCSS>
            <div id="policy-cm" className="policy-square-hc policy-square-vc">
                <div className="policy-main">
                    <img src="/images/fieldbylogo.png" alt="logo" className="policy-logo"/>                    
                    <span className="policy-title">이용약관</span>

                    <p className="policy-info">

                    <h2>제 1조 (목적)</h2>        
                    <span className="policy-info-detail">
                    이 이용약관(이하 "약관"이라 함)은 주식회사 플로우업(이하 "회사"라 함)이 제공하는 서비스를 이용함에 있어 필요한 "광고주"와 "회사", "인플루언서 (이하 "회원"이라 함)간의 제반 사항을 규정함을 그 목적으로 합니다. 본 약관은 웹, 스마트폰(안드로이드폰, 아이폰 등) 앱 등을 이용하는 전자상거래에 대해서도 그 성질에 반하지 않는 한 준용됩니다.
                    </span>
                    <br/><br/><br/>

                    <h2>제 2조 (정의)</h2>
                    <span className="policy-info-detail">
                    이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
                    <br/><br/>1. "필드바이"라 함은 "광고주"의 콘텐츠(상품 리뷰 등)를 만들어 줄 "회원"을 모집하고 선별하는 과정이 이루어지는 가상의 온라인 공간입니다. 웹사이트, 모바일웹, 앱 등을 모두 포함합니다.
                    <br/><br/>2. "필드바이 비즈니스 스위트"라 함은 "회사"가 "광고주"에게 제공하는 서비스와 관련하여 "광고주"에게 필요한 정보를 제공하는 가상의 온라인 공간입니다. "필드바이 비즈니스 스위트"에서는 "필드바이"를 통해 진행되는 "회원"의 모집 및 선별 과정에 대한 정보와 제작된 콘텐츠의 광고 효과에 대한 정보를 제공합니다.
                    <br/><br/>3. "서비스"라 함은 "필드바이"를 이용하여 "광고주"의 콘텐츠를 만들어 내고, "필드바이 비즈니스 스위트"에 그 과정에 대한 안내 사항을 제공하는 것을 의미합니다.
                    <br/><br/>4. "광고주"라 함은 "서비스"를 이용하기 위해 이 약관에 따라 "회사"와 이용계약을 체결하고 광고주 아이디를 부여 받아 회사가 제공하는 "서비스"를 이용하는 이용고객을 의미합니다.
                    <br/><br/>5. "회원"이라 함은 광고주의 상품을 체험하고 콘텐츠를 만들어 내는 필드바이 회원을 의미합니다.
                    </span>
                    <br/><br/><br/>
                    
                    <h2>제 3조 약관의 명시와 개정</h2>
                    <span className="policy-info-detail">
                    1. "회사"는 이 약관의 내용을 "광고주"가 계약 시 확인할 수 있도록 첨부합니다.
                    <br/><br/>2. "회사"는 필요한 경우 관련 법령을 위배하지 않는 범위 내에서 이 약관을 개정할 수 있으며, 이 경우 개정내용과 적용일자를 명시하여 필드바이 비즈니스 스위트 초기화면을 통하여 그 적용일자 15일 전부터 적용일자 전일까지 공지합니다.
                    <br/><br/>3. "광고주"가 개정약관에 동의하지 않는 경우에는 개정 약관의 적용일 이전에 거부 의사를 표시하고 이용계약을 해지할 수 있습니다.
                    </span>
                    <br/><br/><br/>

                    <h2>제 4조 약관 외 해석</h2>
                    <span className="policy-info-detail">
                    이 약관에 명시하지 않은 사항이나 해석에 대해서는 계약 당시 동의 서명하신 이용약관을 따릅니다.
                    <br/><br/>1. 계약 상품에 따라 계약서에 '재계약 특별 약관' 이 명시 된 경우, 계약 당시 동의 서명하신 이용약관을 따릅니다.
                    <br/><br/>2. 대금 결제 방식에 따라 계약서에 아래 약관이 명시된 경우, 계약 당시 동의 서명하신 이용약관을 따릅니다.
                    <br/><br/>&nbsp; &nbsp; &nbsp; &nbsp; a. 출금 자동이체 약관
                        <br/>&nbsp; &nbsp; &nbsp; &nbsp; b. 금융거래 정보의 제공 동의
                        <br/>&nbsp; &nbsp; &nbsp; &nbsp; c. 신용카드 이용 광고료 납입 특별 약관
                    </span>
                    <br/><br/><br/>

                    <h2>제 5조 광고주 가입</h2>
                    <span className="policy-info-detail">
                    1. "서비스"를 이용하고자 하는 이용고객은 "회사"가 정한 절차에 따라 이 약관에 동의하고 광고주 등록을 신청하여야 하며, "회사"는 이를 승낙함으로써 광고주 가입이 완료됩니다.
                    <br/><br/>2. 광고주 가입이 성립되면, 회사는 광고주에게 "필드바이 비즈니스 스위트" 아이디를 부여합니다.
                    <br/><br/>3. "회사"는 제 1항과 같이 광고주 등록을 신청한 이용고객(이하 '가입신청자') 중 아래 각호에 해당되는 경우에는 승인을 거부할 수 있으며, 등록이 된 이후에도 아래 각호의 사유가 확인된 경우에는 승낙을 취소할 수 있습니다.
                        <br/><br/>&nbsp; &nbsp; &nbsp; &nbsp; a. 가입신청자가 이 약관에 의하여 이전에 본 서비스에 관하여 광고주 자격을 상실한 사실이 있는 경우
                        <br/>&nbsp; &nbsp; &nbsp; &nbsp; b. 가입신청자가 본 약관의 목적이 된 사업의 사업자등록상 대표자가 아닌 경우
                        <br/>&nbsp; &nbsp; &nbsp; &nbsp; c. 가입신청시 허위정보를 기재하거나, "회사"가 요구하는 내용을 기재하지 않은 경우
                        <br/>&nbsp; &nbsp; &nbsp; &nbsp; d. 기타 본 약관에 따른 요건을 위반하여 신청하는 경우
                    </span>
                    <br/><br/><br/>

                    <h2>제 6조 광고주 및 서비스 이용을 위한 정보 제공, 등록, 변경</h2>
                    <span className="policy-info-detail">
                    1. "회사"는 "광고주"의 정보를 "필드바이" 이용자들에게 제공하기 위하여 "광고주"의 상호, 대표자 성명, 연락처, 주소, 사업자등록번호, 생년월일 및 판매상품 등에 대한 정보를 수집합니다.
                    <br/><br/>2. 제1항에 따른 정보 수집 및 등록, 관리 업무는 "회사"가 실시합니다.
                    <br/><br/>3. "광고주"는 가입신청시 기재한 정보가 변경 되었을 경우 그 즉시 변경사실을 회사에 통지해야 합니다. 회사는 "광고주"가 관련 변경통지를 하지 아니하여 발생하는 손해에 대하여는 책임을 부담하지 않습니다.
                    <br/><br/>4. "광고주"는 "서비스"를 이용하는 과정에서 "회사" 또는 "회원"에게 저작권, 초상권 기타 타인의 권리를 침해하는 자료를 제공해서는 안되며, "광고주"가 이를 위반하여 "회사" 또는 "회원"에게 법적분쟁이 발생할 경우 이로 인한 모든 책임은 "광고주" 가 부담합니다.
                    <br/><br/>5. "광고주"가 전항을 위반하여 민원이 제기 되거나 분쟁이 발생할 경우 해당 게시물은 광고주의 동의 없이 다음과 같은 조치가 실시될 수 있으며, 회사에 손해가 발생하는 경우 광고주는 이로 인한 손해를 배상해야 합니다.
                    <br/><br/>&nbsp; &nbsp; &nbsp; &nbsp; a. 관련 콘텐츠의 게시중지
                    <br/>&nbsp; &nbsp; &nbsp; &nbsp; b. 관련 콘텐츠의 삭제 또는 수정
                    </span>
                    <br/><br/><br/>

                    <h2>제 7조 저작물 이용권</h2>
                    <span className="policy-info-detail">
                    1. "광고주"는 회원이 필드바이 사이트에 콘텐츠를 등록한 날로부터 1년간 "서비스"에 따라 제작된 콘텐츠를 국내 및 해외에서 이용할 수 있는 권리를 갖습니다.
                    <br/><br/>2. 제1항에 따른 권리에는 해당 콘텐츠의 복제권, 전시권, 배포권, 초상권 및 2차적 저작물 작성권이 포함되며, "회사"는 해당 콘텐츠 이용시 반드시 그 출처를 표시해야합니다.
                    <br/><br/>3. "회사"는 "광고주"에게 제1항에 따른 기간이 경과한 후 해당 저작물에 대한 이용중단을 요청을 할 수 있으며," 광고주"는 해당 요청에 성실히 응해야 합니다.
                    <br/><br/>4. "회사"는 해당 "콘텐츠"가 타인의 권리를 침해할 가능성이 있거나 회사정책 또는 관련 법률을 위반 하였다고 평가될 경우 "광고주"에게 해당 저작물 이용을 중단할 것을 요청 할 수 있습니다.
                    </span>
                    <br/><br/><br/>

                    <h2>제 8조 이용요금 납입</h2>
                    <span className="policy-info-detail">
                    1. "광고주"는 자동이체 또는 일시불 계좌이체를 통하여 "회사"에 본 약관에 따른 서비스 이용요금을 지급합니다.
                    <br/><br/>2. 전항의 경우, 자동이체일은 계약일로부터 10일 이내로 설정해야 합니다.
                    <br/><br/>3. "광고주"가 제1항에 따른 자동이체신청서를 작성하신 경우 하기의 "안심자동이체 약관" 및 "금융거래정보의 제공동의"에 동의한 것으로 간주합니다.
                    </span>
                    <br/><br/><br/>

                    <h2>제 9조 광고주 탈퇴</h2>
                    <span className="policy-info-detail">
                    1. "광고주"는 언제든지, "회사"의 고객센터로 탈퇴를 신청할 수 있으며, "회사"는 관련 법이 정하는 바에 따라 이를 처리합니다.
                    <br/><br/>2. 전항에 따라 탈퇴가 완료된 경우, 회사는 관련 법률 및 개인정보취급방침에 따라 의무적으로 보유해야 하는 정보를 제외하고는 탈퇴가 완료되는 즉시 광고주에 관한 정보를 삭제합니다.
                    <br/><br/>3. 본 조에 따라 탈퇴가 완료된 이후에도 "광고주"가 "서비스"에 따라 탈퇴 전에 작성된 콘텐츠(상품리뷰 등)는 삭제되지 않습니다.
                    </span>
                    <br/><br/><br/>

                    <h2>제 10조 계약의 해지</h2>
                    <span className="policy-info-detail">
                    1. 계약의 해지, "서비스"의 이용중단 또는 취소는 사전에 공지된 절차에 따라 각 상품별로 "회사"의 고객센터에 요청해야 하며, 다만 주말, 공휴일 기타 "회사"의 휴일에 요청된 사안에 관하여는 해당 휴일 이후 첫 영업일에 접수된 것으로 간주하여 처리됩니다.
                    <br/><br/>2. 다음 각호의 사안이 발생할 경우 회사는 광고주에게 계약해지를 통보할 수 있으며 계약해지의 효력은 통지 즉시 발생합니다.
                    <br/><br/>&nbsp; &nbsp; &nbsp; &nbsp; a. 회원들로부터 "광고주"에 관하여 헛걸음, 약속불이행, 크리에이터 비하발언 기타 이와 유사한 컴플레인이 연 3회 이상 발생한 경우
                    <br/>&nbsp; &nbsp; &nbsp; &nbsp; b. 성희롱, 성추행, 폭력 기타 "광고주"가 제공하는 서비스의 질적 수준을 현저히 의심할 수 있는 컴플레인 이 발생한 경우
                    <br/><br/>3. 제2항에 따라 계약이 해지되고 이로 인하여 회사에 손해가 발생할 경우, 회사는 광고주에게 이에 관한 손해배상을 청구할 수 있습니다.
                    </span>
                    <br/><br/><br/>

                    <h2>제 11조 이용요금 환불 및 납입이자, 양도</h2>
                    <span className="policy-info-detail">
                    1. 본 약관에 따른 서비스 이용권은 유효기간 내에서만 효력이 있으며, 유효기간이 경과한 권리는 그 즉시 모두 소멸합니다. 다만 "광고주"가 "회사"의 귀책사유에 의하여 "서비스"를 이용할 수 없었던 경우에는 "회사"와 협의를 통하여 소멸 여부를 조정할 수 있습니다.
                    <br/><br/>2. "광고주"가 계약을 중도해지할 경우, "회사"는 다음 각 호의 금액 중 가장 높은 금액을 위약금으로 부과하며 계약원금 총액에서 해당 위약금을 공제한 차액을 환불합니다.
                    <br/><br/>&nbsp; &nbsp; &nbsp; &nbsp; a. "회사"가 보유한 플랫폼과 온라인 매체를 이용하여 콘텐츠 제작과 배포를 위해 지출한 서비스비용 총액
                    <br/>&nbsp; &nbsp; &nbsp; &nbsp; b. 총 서비스 금액을 유효기간 내 월별 금액으로 분할하고, 서비스 개시일로부터 중도해지 완료일이 속한 달의 말일까지의 월별 금액을 합산한 금액
                    <br/>&nbsp; &nbsp; &nbsp; &nbsp; c. 계약원금 총액에 계약 당시 동의 서명한 이용약관에 특정된 위약금 비율(10~20%)을 적용한 금액
                    <br/><br/>3. "회사"는 "광고주"가 계약해지 기타 사유 여하를 불문하고 본 약관에 따른 서비스 중단 또는 환불을 요청할 경우, 제2항에 의거하여 납입한 원금에서 이용요금과 위약금을 제외하고 환불합니다.
                    <br/><br/>4. "서비스"는 계약 대상인 "광고주"만 이용가능하며 타인에게 양도할 수 없습니다.
                    </span>
                    <br/><br/><br/>

                    <h2>제 12조 서비스의 책임 제한</h2>
                    <span className="policy-info-detail">
                    1. "회사"는 천재지변 또는 이에 준하는 불가항력으로 인하여 "서비스"를 제공할 수 없는 경우 "서비스" 제공에 관한 책임을 부담하지 않습니다.
                    <br/><br/>2. "회사"는 "광고주"의 귀책사유로 인한 "서비스" 이용장애에 대하여는 책임을 부담하지 않습니다.
                    <br/><br/>3. "서비스" 제공 과정에서 "광고주"와 "회원" 사이에 다음 각 문제가 발생하더라도 "회사"는 이에 대하여 일체의 책임을 부담하지 않습니다.
                    <br/><br/>&nbsp; &nbsp; &nbsp; &nbsp; a. "광고주"의 제품 등(용역을 포함함. 이하 같음)이 "회원"에게 제공되는 과정에서 제품의 멸실 또는 하자가 발생한 경우
                    <br/>&nbsp; &nbsp; &nbsp; &nbsp; b. "회원"에게 제공되었던 제품 등의 회수 과정에서 제품 등이 훼손·분실되거나 여타의 사유로 회수가 불가능한 상태에 이른 경우
                    <br/><br/>4. "회사"는 "광고주"가 "서비스"에 관하여 제공한 자료 및 "광고주"의 웹사이트에 게재된 정보 등의 신뢰도와 정확성에 관하여 책임을 부담하지 않습니다.
                    <br/><br/>5. "회사"는 제12조에 관하여 문제가 발생하여 "회사"에게 손해가 발생할 경우 "광고주"에게 손해 배상을 청구할 수 있습니다.
                    </span>
                    <br/><br/><br/>

                    <h2>제 13조 회원 개인 정보 보호 및 파기 의무</h2>
                    <span className="policy-info-detail">
                    1. "회사"는 "서비스" 운영을 위하여 "광고주"에게 "회원" 의 개인 정보를 제공합니다. "광고주"는 "회사" 에서 제공받은 회원의 개인 정보를 "서비스" 운영 목적이 달성된 후 즉시 파기 합니다. (「개인정보 보호법」 제21조제4항 및 「개인정보 보호법 시행령」 제16조제1항)
                    <br/><br/>&nbsp; &nbsp; &nbsp; &nbsp; a. 전자적 파일 형태인 경우: 복원이 불가능한 방법으로 영구 삭제
                    <br/>&nbsp; &nbsp; &nbsp; &nbsp; b. 위의 유형 외의 기록물, 인쇄물, 서면, 그 밖의 기록매체인 경우: 파쇄 또는 소각
                    <br/><br/>2. "회사" 로 부터 전달 받은 개인정보를 "서비스" 운영 목적 외에 별도 서면 동의 없이 제 3자에게 제공 불가합니다. 또한, "광고주"가 개인정보가 분실ㆍ도난ㆍ유출ㆍ위조ㆍ변조 또는 훼손되지 아니하도록 내부 관리계획 수립, 접속기록 보관 등 안전성 확보에 필요한 기술적ㆍ관리적 및 물리적 조치를 취해야 합니다.
                    <br/><br/>3. 개인정보 보호법에 따라, 개인정보를 파기하지 않은 자는 2년 이하의 징역 또는 2천만원 이하의 벌금에 처벌 받을 수 있습니다. (「개인정보 보호법」 제73조제1호의2). "광고주" 는 회원 개인 정보 보호 및 파기 의무를 미준수하여 손해가 발생할 경우, "회사"에 책임을 부담할 수 없습니다.
                    </span>
                    <br/><br/><br/>

                    <h2>제 14조 준거법 및 관할법원</h2>
                    <span className="policy-info-detail">
                    본 약관은 대한민국법령에 의하여 규정하고 이행 되며, 서비스 이용과 관련하여 회사, 회원 및 광고주 사이에 발생한 분쟁에 대해서는 서울중앙지방법원을 전속관할법원으로 하여 해결합니다.

                    <br/><br/>1. 공고 일자 : 2022. 06. 01
                    <br/><br/>2. 시행 일자 : 2022. 06. 01
                    </span>
                    <br/><br/>

                    <span>(주)플로우업은 고객님과 계약 시점에, 위 이용약관에 대해 서면으로 안내하고 동의 서명을 받고 있음을 안내 드립니다.</span>
                    </p>                    
                </div>
            </div>
        </PolicyContainerCSS>
    )
}

const PolicyContainerCSS = styled.div`
    #policy-cm {
        position : absolute;
        min-width : 1000px;
        min-height : 800px;
        overflow-y : scroll;
    }
    .policy-square-hc {
        width : 90%;
        left : 0;
        right : 0;
        margin-left : auto;
        margin-right : auto;
        background : #ffffff;
        box-shadow : 2px 2px 10px rgba(0,0,0, 0.07);
        border-radius : 5px;
    }
    .policy-square-vc {
        height : 80%;
        top : 0;
        bottom : 0;
        margin-top : auto;
        margin-bottom : auto;
    }
    .policy-main {
        display : grid;
        padding-top : 2%;
        padding-bottom : 5%;
        padding-left : 27%;
        padding-right : 27%;
        .policy-logo {
            height : 43px;
            width : 133px;
        }
        .policy-title {
            margin-top : 60px;
            font-size : 24px;
            font-weight : 700;
        }
        .policy-info {
            .policy-info-detail {
                font-size : 15px;
                letter-spacing : 0.7px;
                line-height : 18px;
            }
        }
    }
`

export default Policy;
